000_РОЗНИЦА_ЦЕНТР/src/Documents/РаспределениеЗанятостиСотрудников/РаспределениеЗанятостиСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РаспределениеЗанятостиСотрудников</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект_ДП</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект_Питание</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект_Гигиена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект_Одежда</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект_Обувь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект_Игрушки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект_Услуги</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект_Мебель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект_Админ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/РаботникиОрганизаций/РаботникиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаботникиОрганизаций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВидЗанятости</name>
    <type>
      <types>EnumRef.ВидыЗанятости</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </resources>
  <resources>
    <name>ОтделМагазина</name>
    <type>
      <types>CatalogRef.ОтделыМагазинов</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеСотрудника</name>
    <type>
      <types>EnumRef.ПричиныИзмененияСостояния</types>
    </type>
  </resources>
  <resources>
    <name>ПринятНаНовоеРабочееМесто</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <comment>Идентификатор внешнего документа - для обеспечения уникальности записи</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/СостояниеРаботниковОрганизаций/СостояниеРаботниковОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеРаботниковОрганизаций</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияРаботникаОрганизации</types>
    </type>
  </resources>
  <resources>
    <name>ПериодЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СостояниеЗавершения</name>
    <type>
      <types>EnumRef.СостоянияРаботникаОрганизации</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументДвиженияПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументДвижения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОрганизацииПодразделений/ОрганизацииПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОрганизацииПодразделений</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Владелец</name>
    <comment>Элемент справочника, периодичность реквизита которого мы обеспечиваем.</comment>
    <type>
      <types>String</types>
      <types>CatalogRef.Магазины</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СостоянияРаботникаОрганизации/СостоянияРаботникаОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияРаботникаОрганизации</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Работает</name>
  </enumValues>
  <enumValues>
    <name>НеРаботает</name>
  </enumValues>
  <enumValues>
    <name>Заболевание</name>
  </enumValues>
  <enumValues>
    <name>Командировка</name>
  </enumValues>
  <enumValues>
    <name>ОтпускЕжегодный</name>
  </enumValues>
  <enumValues>
    <name>ОтпускУчебный</name>
  </enumValues>
  <enumValues>
    <name>ОтпускБезСохраненияЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствуетПоНевыясненнойПричине</name>
  </enumValues>
  <enumValues>
    <name>ОтпускУчебныйНеоплачиваемый</name>
  </enumValues>
  <enumValues>
    <name>ВынужденныйПрогул</name>
  </enumValues>
  <enumValues>
    <name>ГосударственныеОбязанности</name>
  </enumValues>
  <enumValues>
    <name>Прогулы</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеВыходныеДниОплачиваемые</name>
  </enumValues>
  <enumValues>
    <name>Простой</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодам</name>
  </enumValues>
  <enumValues>
    <name>Мобилизован</name>
  </enumValues>
  <enumValues>
    <name>ДругиеНеявки</name>
  </enumValues>
  <enumValues>
    <name>ПриостановкаТрудовогоДоговора</name>
    <comment>Приостановка трудового договора</comment>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаВыдачиПаспорта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КемВыданПаспорт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПаспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСотрудника</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Documents/РаспределениеЗанятостиСотрудников/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура МагазинПриИзменении(Элемент)
	//ЗаполнитьСотрудников();
КонецПроцедуры             

             

&НаСервере
Процедура ЗаполнитьСотрудников(Сотрудник = Неопределено) 
	Если Сотрудник = Неопределено Тогда
		Объект.Сотрудники.Очистить();
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	РаботникиОрганизаций.Сотрудник КАК Сотрудник,
	               |	РаботникиОрганизаций.Должность КАК Должность,
	               |	РаботникиОрганизаций.Магазин КАК Магазин
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		РаботникиОрганизаций.Организация КАК Организация,
	               |		РаботникиОрганизаций.Сотрудник КАК Сотрудник,
	               |		МАКСИМУМ(РаботникиОрганизаций.ПериодНачала) КАК ПериодНачала
	               |	ИЗ
	               |		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		РаботникиОрганизаций.Организация,
	               |		РаботникиОрганизаций.Сотрудник) КАК ВложенныйЗапрос1
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				СостояниеРаботниковОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
	               |				МАКСИМУМ(СостояниеРаботниковОрганизацийСрезПоследних.Период) КАК Период,
	               |				СостояниеРаботниковОрганизацийСрезПоследних.Организация КАК Организация
	               |			ИЗ
	               |				РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних КАК СостояниеРаботниковОрганизацийСрезПоследних
	               |			ГДЕ
	               |				СостояниеРаботниковОрганизацийСрезПоследних.Организация = &Организация
	               |				И СостояниеРаботниковОрганизацийСрезПоследних.Сотрудник.Магазин = &Магазин
	               |				И СостояниеРаботниковОрганизацийСрезПоследних.Сотрудник.Уволен = ЛОЖЬ
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				СостояниеРаботниковОрганизацийСрезПоследних.Сотрудник,
	               |				СостояниеРаботниковОрганизацийСрезПоследних.Организация) КАК ВложенныйЗапрос
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних КАК СостояниеРаботниковОрганизацийСрезПоследних
	               |				ПО ВложенныйЗапрос.Сотрудник = СостояниеРаботниковОрганизацийСрезПоследних.Сотрудник
	               |					И ВложенныйЗапрос.Период = СостояниеРаботниковОрганизацийСрезПоследних.Период
	               |			ПО РаботникиОрганизаций.Сотрудник = ВложенныйЗапрос.Сотрудник
	               |				И РаботникиОрганизаций.Организация = ВложенныйЗапрос.Организация
	               |		ПО ВложенныйЗапрос1.Организация = РаботникиОрганизаций.Организация
	               |			И ВложенныйЗапрос1.Сотрудник = РаботникиОрганизаций.Сотрудник
	               |			И ВложенныйЗапрос1.ПериодНачала = РаботникиОрганизаций.ПериодНачала
	               |ГДЕ
	               |	(ЕСТЬNULL(СостояниеРаботниковОрганизацийСрезПоследних.Состояние, 0) = 0
	               |			ИЛИ СостояниеРаботниковОрганизацийСрезПоследних.Состояние В (&СостоянияРаботающих)
	               |			ИЛИ СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения < &КонецПериода
	               |				И СостояниеРаботниковОрганизацийСрезПоследних.СостояниеЗавершения В (&СостоянияРаботающих))
	               |	И РаботникиОрганизаций.Сотрудник.Магазин = &Магазин
	               |	И РаботникиОрганизаций.Сотрудник.Уволен = ЛОЖЬ
	               |	И РаботникиОрганизаций.Организация = &Организация
	               |	И РаботникиОрганизаций.ЗанимаемыхСтавок > 0";

	Если Сотрудник <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + " И РаботникиОрганизаций.Сотрудник = &Сотрудник";
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	КонецЕсли;                                                     
	
	//2025-07-02 sa Нужно подсвечивать цветом уволенных сотрудников. для этого нужно определить в каком они состоянии находятся.
	МассивСостоянийРаботающихСотрудников = Новый Массив;
	МассивСостоянийРаботающихСотрудников.Добавить(Перечисления.СостоянияРаботникаОрганизации.Работает);
	МассивСостоянийРаботающихСотрудников.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускЕжегодный);
	МассивСостоянийРаботающихСотрудников.Добавить(Перечисления.СостоянияРаботникаОрганизации.ПриостановкаТрудовогоДоговора);
	МассивСостоянийРаботающихСотрудников.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускУчебный);
	Запрос.УстановитьПараметр("СостоянияРаботающих",МассивСостоянийРаботающихСотрудников);
	Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(Объект.Дата));
	
	Запрос.УстановитьПараметр("Магазин",Объект.Магазин);
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл 
		ДанныеРаспределения = Объект.Сотрудники;
		НайденныеСотрудники = ДанныеРаспределения.НайтиСтроки(Новый Структура("Сотрудник",Результат.Сотрудник));
		Если НайденныеСотрудники.Количество() = 0 Тогда 
			Строка_ = ДанныеРаспределения.Добавить();
		Иначе
			Строка_ = НайденныеСотрудники[0];
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Строка_,Результат);
	КонецЦикла;
	
	
	
КонецПроцедуры  


&НаКлиенте
Процедура СотрудникиПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Сотрудники.ТекущиеДанные; 
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОбновитьКолонкиТаблицыРаспределения();
	ОбновитьИтоги(ТекущаяСтрока.НомерСтроки-1);

КонецПроцедуры

&НаСервере
Процедура ОбновитьИтоги(ИндексСтроки)
	ТекСтрока = Объект.Сотрудники[ИндексСтроки];
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	ТекСтрока.Итог = 0;
	ДанныеРаспределения = Объект.Сотрудники.Выгрузить();
	Для Каждого Колонка_ Из ДанныеРаспределения.Колонки Цикл
		Если Найти(Колонка_.Имя,"Проект_")=0 Тогда
			Продолжить;
		КонецЕсли;
		ТекСтрока.Итог = ТекСтрока.Итог + ТекСтрока[Колонка_.Имя];
	КонецЦикла;

	
КонецПроцедуры


&НаСервере
Процедура ОбновитьКолонкиТаблицыРаспределения()

	Для Каждого СтрокаСотрудник Из Объект.Сотрудники Цикл
		ПараметрыСотрудника = ПолучитьПараметрыСотрудника(СтрокаСотрудник.Сотрудник);
		СтрокаСотрудник.Должность = ПараметрыСотрудника.Должность;
		СтрокаСотрудник.ИНН = ПараметрыСотрудника.ИНН; 
		ОбновитьИтоги(СтрокаСотрудник.НомерСтроки-1);
	КонецЦикла;
	
КонецПроцедуры  


&НаСервере
Функция ПолучитьПараметрыСотрудника(Сотрудник) 
	Ответ = Новый Структура("Должность,ИНН,Сотрудник");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ФизическиеЛица.Ссылка КАК Сотрудник,
	               |	РаботникиОрганизаций.Должность КАК Должность,
	               |	ФизическиеЛица.ИНН КАК ИНН
	               |ИЗ
	               |	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |		ПО РаботникиОрганизаций.Сотрудник = ФизическиеЛица.Ссылка
	               |ГДЕ
	               |	ФизическиеЛица.Магазин = &Магазин
	               |	И ФизическиеЛица.Сотрудник = ИСТИНА
	               |	И ФизическиеЛица.Уволен = ЛОЖЬ
	               |	И ФизическиеЛица.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Сотрудник);
	Запрос.УстановитьПараметр("Магазин",Объект.Магазин);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Ответ,Результат);
	КонецЦикла;
	
	Возврат Ответ;
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	ОбновитьКолонкиТаблицыРаспределения();
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекущийОбъект.УстановитьНовыйНомер(Формат(Объект.Магазин.НомерМагазина,"ЧЦ=3; ЧДЦ=0; ЧВН=; ЧГ=; ЧФ=Ч-"));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьКолонкиТаблицыРаспределения();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	Если не ЗначениеЗаполнено(Объект.Магазин) тогда 
		Объект.Магазин = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин;	
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Объект.Организация) тогда 
		//Объект.Организация = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин,"Организация");	
		Объект.Организация = ПолучитьОрганизацию(ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин);	
	КонецЕсли;
	
	Если Объект.Сотрудники.Количество() = 0 Тогда
  		ЗаполнитьСотрудников(); 
	КонецЕсли;
	ОбновитьКолонкиТаблицыРаспределения(); 


КонецПроцедуры

&НаСервере
Функция ПолучитьОрганизацию(Магазин)
	ОрганизацИЯ = Справочники.Организации.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ 
		|	ОрганизацииПодразделенийСрезПоследних.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.ОрганизацииПодразделений.СрезПоследних(&ТекДата, Владелец = &Владелец) КАК ОрганизацииПодразделенийСрезПоследних";
	
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Владелец", Магазин);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОрганизацИЯ = ВыборкаДетальныеЗаписи.Организация;	
	КонецЦикла;
	Возврат Организация;
КонецФункции

&НаКлиенте
Процедура КомандаЗаполнить(Команда) 
	Если Объект.Сотрудники.Количество() >0 Тогда
		Ответ = Вопрос("Таблица сотрудников уже заполнена. Вы действительно хотите ее очистить?",РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ЗаполнитьСотрудников();
		КонецЕсли;
	Иначе
		ЗаполнитьСотрудников();
	КонецЕсли;
	
	ОбновитьКолонкиТаблицыРаспределения();
КонецПроцедуры
